[{"title":"Coco Official US Teaser Trailer","author":"Disney•Pixar ","views":897304,"date":"20170315","id":26814087,"description":"Coco opens in US theatres in 3D on November 22! Despite his family’s baffling generations-old ban on music, Miguel (voice of newcomer Anthony Gonzalez) dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz (voice of Benjamin Bratt). Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector (voice of Gael García Bernal), and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history. Directed by Lee Unkrich (“Toy Story 3”), co-directed by Adrian Molina (story artist “Monsters University”) and produced by Darla K. Anderson (“Toy Story 3”), Disney•Pixar’s “Coco” opens in U.S. theaters on Nov. 22, 2017.","category":"Film & Animation"},
{"title":"Creepy Tide Pool Creatures!","author":"Brave Wilderness ","views":1575793,"date":"20170315","id":4337461,"description":"Please SUBSCRIBE - http://bit.ly/BWchannel Watch More - http://bit.ly/BTTseasnake On this episode of Beyond the Tide, Coyote discovers some of the most bizarre and creepy tide pool creatures Costa Rica has to offer! From 5 foot long sea worms to hundreds of slimy sea cats this video is sure to make your skin crawl! Get ready to head back out beyond the tide! Our new series Beyond the Tide explores the mysterious world of the ocean and brings you closer than ever to its most fascinating creatures. Whether it’s tide pools, lagoons or the deepest depths of the sea Coyote Peterson and the Brave Wilderness crew will take you there! The Brave Wilderness Channel is your one stop connection to a wild world of adventure and amazing up close animal encounters! Follow along with adventurer and animal expert Coyote Peterson and his crew as they lead you on four exciting expedition series including the Emmy Award Winning Breaking Trail, Dragon Tails, Coyote’s Backyard and Beyond the Tide - featuring everything from Grizzly Bears and Crocodiles to Rattlesnakes and Tarantulas…each episode offers an opportunity to learn something new. So SUBSCRIBE NOW and join the adventure that brings you closer to the most beloved, bizarre and misunderstood creatures known to man! GET READY...things are about to get WILD! New Episodes Every Wednesday and Friday at 9AM EST Subscribe Now! https://www.youtube.com/BraveWilderness Find more info at: http://coyotepeterson.com/ Coyote Peterson on Twitter: https://twitter.com/CoyotePeterson Coyote Peterson on Facebook: https://www.facebook.com/CoyotePeterson Coyote Peterson on Instagram: https://www.instagram.com/CoyotePeterson Coyote Peterson G+: https://plus.google.com/1003108037546...","category":"Pets & Animals"},
{"title":"Film Theory: The Cars in The Cars Movie AREN'T CARS!","author":"The Film Theorists ","views":2830527,"date":"20170314","id":7874724,"description":"N/A","category":"N/A"},
{"title":"Despicable Me 3 - In Theaters June 30 - Official Trailer #2 (HD)","author":"Illumination ","views":2564828,"date":"20170314","id":7215162,"description":"Despicable Me 3 - Official Trailer http://www.despicable.me The team who brought you Despicable Me and the biggest animated hits of 2013 and 2015, Despicable Me 2 and Minions, returns to continue the adventures of Gru, Lucy, their adorable daughters—Margo, Edith and Agnes—and the Minions. Despicable Me 3, directed by Pierre Coffin and Kyle Balda, co-directed by Eric Guillon, and written by Cinco Paul & Ken Daurio, will be released in theaters on June 30, 2017. The animated film is produced by Illumination’s Chris Meledandri and Janet Healy, and executive produced by Chris Renaud. Joining Steve Carell and Kristen Wiig in Despicable Me 3 is Emmy, Tony and Grammy Award winner Trey Parker, co-creator of Comedy Central’s global phenomenon South Park and the Broadway smash The Book of Mormon. Parker voices the role of villain Balthazar Bratt, a former child star who’s grown up to become obsessed with the character he played in the ‘80s, and proves to be Gru’s most formidable nemesis to date.","category":"Entertainment"},
{"title":"DIY Light Box","author":"Living to DIY with Rachel Metz","views":247461,"date":"20160615","id":2940219,"description":"N/A","category":"N/A"},
{"title":"DIY Upcycled Home Decor","author":"Living to DIY with Rachel Metz","views":10921,"date":"20170215","id":5469489,"description":"Ever wonder what the hell to do with that broken household item that you love and don’t want to throw away? Or maybe you found a good score at a Goodwill but you want to do it justice by adding some life to it? Then you are just like me! I have had these household items laying around for quite some time with hopes I’d get to trying to figure out how I would actually use them. Update: I figured that out (kinda) and decided today I’m bringing you three recycled DIY home decor or upcycled DIY home decor ideas. These may not be exactly what you have laying around your house but hopefully it inspires you to think before you throw away. I am showing you how to DIY some coasters to your advantage, that a coat of spray paint can make everything better, fix that broken wooden tray and give it some more personality. I can’t wait to do more of these videos but need to know if you like them so be sure to give this a thumbs up if you want more. Stay rad, thank you for getting us to 17K xx. Did you know that if you aren’t a part of my subscriber DIY series that I sell all my DIY's that are collecting dust? http://etsy.me/2hmtOao Connect with me outside this YouTube bubble... Instagram http://bit.ly/2eUALeQ Pinterest http://bit.ly/2fmG6w4 Contact rachellivingtodiy@gmail.com 0:11 Update practically anything 0:47 Upcycle DIY wood tray 2:57 Chalkboard Coasters Update practically anything Spray paint (silver I used http://bit.ly/2l8YGuO ) The thing you want to update Upcycle DIY wood tray Whatever tray you have that may or may not be broken If it’s broken - wood glue and clamp/tape it overnight to dry Stickers if you want it to say something on the bottom Matte Mod Poge Magic Glue http://bit.ly/2kTzL03 Glitter To get rid of wood dings - dip a paint brush in wood stain, brush over and then wipe with paper towel after! Chalkboard Coasters Old coasters Chalkboard paint Paint brush Spray paint or paint colors for accents and painting the holder if you have one Those Nights (Vlog Music) by Dj Quads https://soundcloud.com/aka-dj-quads Music provided by Audio Library https://youtu.be/anp_exOmsgc","category":"Howto & Style"},
{"title":"DIY Wall Shelf","author":"Living to DIY with Rachel Metz","views":5069,"date":"20170315","id":3200664,"description":"I told you I was going to show you what I’m DIY’ing for my bedroom and this is part of it. I feel like this video packs less of a punch than last week but who knows!? Maybe you guys needed somewhere to put all that room decor you just made. Anyway! I am hyped on how these shelves came out and am shocked that I actually made them/they stayed in the wall. I looked up a million ways to do this and although the “tried” percentages on Pinterest scared me away from most - I did like a hybrid of all the blog posts I saw on this without the L brackets on the bottom. This DIY shelving made the biggest difference in the vibe of our room. It felt super modern before and we were trying to make it more cozy. Being able to layer photos, textures and have larger home decor accents mixed in makes for the perfect touch. A bonus to this is that it is SO simple to change out the decor which I think will lead me to OCD decorating. Hope you enjoyed this DIY! Give it a thumbs up if you’d like to see more larger scale home improvement DIY’s - I’m no professional by any means, I’d just show you how I personally execute it. It ain’t always cute! Stay rad you guys, thanks for all the love xx. Did you know that if you aren’t a part of my subscriber DIY series that I sell all my DIY's that are collecting dust? http://etsy.me/2hmtOao Connect with me outside this YouTube bubble... Instagram http://bit.ly/2eUALeQ Pinterest http://bit.ly/2fmG6w4 Contact rachellivingtodiy@gmail.com Materials to make one shelf… 2 longer pieces of wood length and width of your choice for your space for the backing and actually shelf part of the shelf - I used 1 x 4 x 4 I used drywall anchors and screws but hang them whatever way you’re good at unlike me haha 1 same length but skinner piece of wood for the front of the shelf - I used 1 x 2 x 4 Spray paint or wood stain Wood screws Electric drill Wood glue Tonez&Re-C - Kyoto by @TONEZPRO (OFFICIAL) https://soundcloud.com/tonez-pro Creative Commons — Attribution 3.0 Unported— CC BY 3.0 http://creativecommons.org/licenses/b... Music provided by Audio Library https://youtu.be/vq4okoteFEc","category":"Howto & Style"},
{"title":"DIY Macrame Curtain","author":"Living to DIY with Rachel Metz","views":16711,"date":"20161115","id":4602234,"description":"I am no macrame expert but I’m going to show you my attempt at a DIY macrame curtain for my window. I say attempt because I wish I was an expert at these since I feel like mine looks a little …well, not as good as I wanted it to. The cool thing about this is you can use it as a macrame wall hanging, a room divider and a backdrop for a photo booth. Thank you for all your continuous support, on the next video I will be announcing a giveaway! I am gathering all the materials still and don’t want to show you guys until it’s perfect! Happy Wednesday you beautiful babes xx. The tutorial I used but mine def didn’t come out like that - http://www.abeautifulmess.com/2014/02... Timestamp in other macrame video where I slow down for you 2:50! As always I try my hardest to keep this as easy and simple for the beginner DIY'er as possible. W H A T Y O U ‘ L L N E E D . . . -Macrame cord - I legit used 200 yards (four spools of cord from Michael’s) for a 52 inches wide x 52 inches high window so PLEASE buy more than you need and return it when you don’t use it. WAY easier than five million trips to the craft store like I did -Wooden dowel or pipe from hardware store the width of your window -Two nails -Two hooks -Hammer -Scissors -Rope N O T E S My dowel was 60\" long so I had some space to add stuff on the ends. I measured out 30 individual macrame strange that were roughly 120 inches long then folded them in half and grouped them by twos to create 15 \"groups\" on the dowel to work with. You can get creative and add beads, metallic tape, different colored string or you can dye the whole thing! I left mine white because when I remove those pumpkins at the end of November - I am OVERLOADING it with greenery and that will be my main pop of color. I sell all my DIY's that are collecting dust since I hate wasting! I post them randomly when I have some that I'm not using or aren't a part of the subscriber DIY series. http://etsy.me/2hmtOao Connect with me! i n s t a g r a m // https://www.instagram.com/rachel_metz f a c e b o o k // https://www.facebook.com/RachelMetzBlog p i n t e r e s t // https://www.pinterest.com/rachel_metz t w i t t e r // rachel__metz s n a p c h a t // rachel_metz i n q u i r i e s // rachellivingtodiy@gmail.com Music // Black & Kytt - “Deniro\"","category":"Howto & Style"},
{"title":"DIY Office Hacks & Decor","author":"Living to DIY with Rachel Metz","views":9144,"date":"20160915","id":5281539,"description":"OPEN ME 😏 I know I should be doing Fall shit but I am SO close to finishing my office that it’s become my number one priority. These were all pinspired office decor ideas that I’ve been dying to execute. So today you’ll learn how to make a kraft roll jumbo list, a foot hammock and two easy ways to clean up the wires under your desk. Happy Wednesday babes xx. What you’ll need… DIY Kraft Roll Yarn Scissors Kraft roll DIY Foot Hammock Yarn Scissors Hot glue Piece of fabric 2 pieces of wood DIY Wire Cleanup Scissors Zip ties Velcro pieces - http://www.joann.com/velcro-brand-sti... I sell all my DIY's that are collecting dust since I hate wasting! I post them randomly when I have some that I'm not using or aren't a part of the subscriber DIY series. http://etsy.me/2hmtOao Connect with me! i n s t a g r a m // https://www.instagram.com/rachel_metz f a c e b o o k // https://www.facebook.com/RachelMetzBlog p i n t e r e s t // https://www.pinterest.com/rachel_metz b lo g // https://www.livingtodiy.com t w i t t e r // rachel__metz s n a p c h a t // rachel_metz i n q u i r i e s // rachellivingtodiy@gmail.com","category":"Howto & Style"},
{"title":"Trying the Instagram Rainbow Trend","author":"Good Mythical Morning ","views":674759,"date":"20170315","id":7067829,"description":"Instagram is going crazy for rainbow faces. GMM #1094! Grab a GMM Mug while supplies lasts! http://bit.ly/GMM_Mug SUBSCRIBE to GMM: http://bit.ly/subrl2 | Watch today's GMMore episode: https://goo.gl/wcwPW7 Read about the latest Instagram trend here! https://goo.gl/WdOAtX Join us in donating to the American Refugee Committee at http://arcrelief.org. Every donation goes toward assisting in their mission to provide refugees with health, education, shelter, and protection services. For rules and more info on how to submit a #10SecondTour go to http://www.rhettandlink.com/10secondtour Follow Rhett & Link: Facebook: http://facebook.com/rhettandlink Twitter: http://twitter.com/rhettandlink Tumblr: http://rhettandlink.tumblr.com Instagram: http://instagram.com/rhettandlink Other Rhett & Link Channels: Main Channel: https://youtube.com/rhettandlink Good Mythical MORE: https://youtube.com/user/rhettandlink3 Rhett & Link EXTRAS: https://youtube.com/user/rhettandlink4 GMM Merch: Poster, T-shirt & More: http://bit.ly/RL_Store Coffee Mug: http://bit.ly/GMM_Mug Watch More GMM: Choose a Season: http://bit.ly/2axhxZN Popular Videos: http://bit.ly/2afIJ12 Latest Uploads: http://bit.ly/2aZMw3K Will It?: http://bit.ly/2a64BiV Taste Tests: http://bit.ly/2a4v5hZ Listen to our FREE podcast, Ear Biscuits on: iTunes: http://apple.co/29PTWTM SoundCloud:https://soundcloud.com/earbiscuits JOIN the RhettandLinKommunity: http://bit.ly/rlkommunity Mail us stuff to our P.O. Box: http://rhettandlink.com/contact Submit a Wheel of Mythicality intro video: http://bit.ly/GMMWheelIntro We are two Internetainers dedicated to giving you a daily dose of casual comedy every Monday-Friday on our show \"Good Mythical Morning.\" Thanks for making us a part of your daily routine. Be your mythical best! - Rhett & Link Credits: Executive Producer: Stevie Wynne Levine Writer/Producer: Edward Coleman Writer/Producer: Lizzie Bassett Writer/Producer: Kevin Kostelnik Writer/Producer: Micah Gordon Writer/Producer: Ellie McElvain Associate Producer: Chase Hilt Technical Director/Graphics/Editor: Morgan Locke Editor: Casey Nimmer Additional Graphics/Editing: Matthew Dwyer Art Director: Colin J. Morris Production Assistant: Saagar Shaikh Content Manager: John Warder Set Construction/Dresser: Cassie Cobb Intro Motion Graphics: Digital Twigs http://www.digitaltwigs.com Intro Music: Pomplamoose http://www.youtube.com/pomplamoosemusic Outro Music: Pomplamoose http://www.youtube.com/pomplamoosemusic Wheel of Mythicality Music: http://www.royaltyfreemusiclibrary.com/ All Supplemental Music: Opus 1 Music | http://opus1.sourceaudio.com/ Microphone: ‘The Mouse’ by Blue Microphones http://www.bluemic.com/mouse/","category":"Entertainment"},
{"title":"The Family Behind Viral BBC Video Speaks Out","author":"Wall Street Journal ","views":736636,"date":"20170314","id":7642299,"description":"In their first interview since their children interrupted a live BBC segment on Korean affairs, college professor Robert Kelly and his wife Kim Jung-A spoke to The Wall Street Journal about the circumstances, the chaos, and the global reaction to the now-legendary slapstick video. Photo: Miho Inada/The Wall Street Journal Subscribe to the WSJ channel here: http://bit.ly/14Q81Xy More from the Wall Street Journal: Visit WSJ.com: http://www.wsj.com Follow WSJ on Facebook: http://www.facebook.com/wsjvideo Follow WSJ on Google+: https://plus.google.com/+wsj/posts Follow WSJ on Twitter: https://twitter.com/WSJvideo Follow WSJ on Instagram: http://instagram.com/wsj Follow WSJ on Pinterest: http://www.pinterest.com/wsj/","category":"Entertainment"},
{"title":"Exclusive Look At President Trump's 2005 Tax Return | Rachel Maddow | MSNBC","author":"MSNBC ","views":494415,"date":"20170314","id":3455894,"description":"MSNBC's Rachel Maddow and David Cay Johnston discuss how Johnston obtained the summary pages of President Donald Trump's 2005 tax returns and what they say about the president's tax burden. Maddow also reads a response from the White House. » Subscribe to MSNBC: http://on.msnbc.com/SubscribeTomsnbc About: MSNBC is the premier destination for in-depth analysis of daily headlines, insightful political commentary and informed perspectives. Reaching more than 95 million households worldwide, MSNBC offers a full schedule of live news coverage, political opinions and award-winning documentary programming -- 24 hours a day, 7 days a week. Connect with MSNBC Online Visit msnbc.com: http://on.msnbc.com/Readmsnbc Find MSNBC on Facebook: http://on.msnbc.com/Likemsnbc Follow MSNBC on Twitter: http://on.msnbc.com/Followmsnbc Follow MSNBC on Google+: http://on.msnbc.com/Plusmsnbc Follow MSNBC on Instagram: http://on.msnbc.com/Instamsnbc Follow MSNBC on Tumblr: http://on.msnbc.com/LeanWithmsnbc Exclusive Look At President Trump's 2005 Tax Return | Rachel Maddow | MSNBC","category":"News & Politics"},
{"title":"How Beauty and the Beast Should Have Ended (1991)","author":"How It Should Have Ended ","views":1539753,"date":"20170314","id":9268554,"description":"How Beauty and the Beast Should Have Ended. Watch More HISHEs: https://bit.ly/HISHEPlaylist Subscribe to HISHE: https://bit.ly/HISHEsubscribe Twitter @theHISHEdotcom http://bit.ly/HISHETwitter Instagram @HISHEgram https://instagram.com/hishegram/ Facebook: http://bit.ly/HISHE-FB HISHE Swag: http://www.dftba.com/hishe Special thanks to our Guest Voices: Belle - Emily Liu Beast - Nicholas Andrew Louie https://www.youtube.com/user/Nicholas... Background Artwork by Otis Frampton http://www.otisframpton.com --------------Previous Episodes-------------------- How Rogue One Should Have Ended https://youtu.be/RjR71XpAu0I?list=PL3... How Doctor Strange Should Have Ended https://youtu.be/9e5epVDd9h0?list=PL3... How Star Wars Should Have Ended (Special Edition) https://youtu.be/oXUJiHut7YE?list=PLi... More HISHE Reviews https://www.youtube.com/playlist?list... Villain Pub - The Boss Battle https://youtu.be/bt__1gwGZSA?list=PL3... LEGO Harry Potter in 90 Seconds https://youtu.be/jnbBcAr7XGo?list=PL3... Suicide Squad HISHE https://youtu.be/Wje0SdFWrzU Star Trek Beyond HISHE https://youtu.be/Fymz7yoELS4?list=PL3... Super Cafe: Batman GO https://youtu.be/KntOy6am7CM?list=PL3... Civil War HISHE https://youtu.be/fvLw021rVN0 Villain Pub - The New Smile https://youtu.be/0oP8s4GK1BE?list=PLA... How Batman V Superman Should Have Ended https://youtu.be/pTuyfQ5CR4Q TMNT: Out of the Shadows HISHE https://youtu.be/_ac8xKxeqzk?list=PL3... How Deadpool Should Have Ended https://youtu.be/5vbEcTIAdPs?list=PL3... Hero Swap - Gladiator Starring Iron Man https://youtu.be/P4mY4qmuJas?list=PL3... How X-Men: Days of Future Past Should Have Ended: http://bit.ly/X-MenDOFPHISHE Star Wars - Revenge of the Sith HISHE https://youtu.be/K2ScVx4mRDE Jungle Book HISHE https://youtu.be/WcfDDa5YoV8?list=PL3... BAT BLOOD - A Batman V Superman AND Bad Blood Parody ft. Batman: http://bit.ly/BatBlood Villain Pub - The New Smile: http://bit.ly/VPNewSmile How Finding Nemo Should Have Ended https://youtu.be/7g7kP_Trp0g How Jurassic World Should Have Ended: http://bit.ly/JurassicWorldHISHE How Inside Out Should Have Ended: http://bit.ly/InsideOutHISHE How The Avengers: Age of Ultron Should Have Ended - Part Two: http://bit.ly/UltronPartTwo How The Avengers: Age of Ultron Should Have Ended - Part One: http://bit.ly/UltronPart1 Aquaman V Superman - Hero Swap https://youtu.be/WDwwhiyVAwY?list=PLi... How The Battle of the Five Armies Should Have Ended: http://bit.ly/Battleof5ArmiesHISHE Jurrassic World - Raptor Training: http://bit.ly/RaptorTraining How Guardians of the Galaxy Should Have Ended: http://bit.ly/GuardiansHISHE How The Avengers: Age of Ultron Should Have Ended: http://bit.ly/UltronTeaserHISHE How The Maze Runner Should Have Ended: http://bit.ly/MazeRunnerHISHE How The Amazing Spider-Man 2 Should Have Ended: http://bit.ly/ASM2HISHE Villain Pub- To The Tailor: http://bit.ly/VP-ToTheTailorHISHE The Lego HISHE 2 (The Alternate Ending): http://bit.ly/LegoHISHE2 How Captain America: The Winter Soldier Should Have Ended: http://bit.ly/CaptainAmericaWSHISHE How Godzilla Should Have Ended: http://bit.ly/GodzillaHISHE Villain Pub- To Battle!: http://bit.ly/VP-ToBattleHISHE How Frozen Should Have Ended: http://bit.ly/FrozenHISHE The Lego HISHE: http://bit.ly/TheLegoHISHE How The Batman Begins Should Have Ended: http://bit.ly/BatmanBeginsHISHE How The Desolation of Smaug Should Have Ended: http://bit.ly/SmaugHISHE","category":"NicholasAndrewLouie"},
{"title":"EXCLUSIVE: RuPaul Announces  HE'S MARRIED!","author":"Hollywood Today Live","views":88174,"date":"20170315","id":6327711,"description":"The fabulous RuPaul is married and he's talking about it for the first time on TV!","category":"Entertainment"},
{"title":"Adam Levine Never Stops Touring or Hating on Blake Shelton","author":"The Tonight Show Starring Jimmy Fallon ","views":352876,"date":"20170315","id":19821401,"description":"Adam Levine explains why he hasn't stopped touring since Maroon 5 began and how stupid Blake Shelton is on Season 12 of The Voice. Subscribe NOW to The Tonight Show Starring Jimmy Fallon: http://bit.ly/1nwT1aN Watch The Tonight Show Starring Jimmy Fallon Weeknights 11:35/10:35c Get more Jimmy Fallon: Follow Jimmy: http://Twitter.com/JimmyFallon Like Jimmy: https://Facebook.com/JimmyFallon Get more The Tonight Show Starring Jimmy Fallon: Follow The Tonight Show: http://Twitter.com/FallonTonight Like The Tonight Show: https://Facebook.com/FallonTonight The Tonight Show Tumblr: http://fallontonight.tumblr.com/ Get more NBC: NBC YouTube: http://bit.ly/1dM1qBH Like NBC: http://Facebook.com/NBC Follow NBC: http://Twitter.com/NBC NBC Tumblr: http://nbctv.tumblr.com/ NBC Google+: https://plus.google.com/+NBC/posts The Tonight Show Starring Jimmy Fallon features hilarious highlights from the show including: comedy sketches, music parodies, celebrity interviews, ridiculous games, and, of course, Jimmy's Thank You Notes and hashtags! You'll also find behind the scenes videos and other great web exclusives. Adam Levine Never Stops Touring or Hating on Blake Shelton http://www.youtube.com/fallontonight","category":"Comedy"},
{"title":"Honest Trailers - Beauty and the Beast (1991)","author":"Screen Junkies ","views":1555440,"date":"20170314","id":5758369,"description":"N/A","category":"N/A"},
{"title":"The Voice 2017 Blind Audition - Chris Blue: \"The Tracks of My Tears\"","author":"The Voice ","views":576279,"date":"20170314","id":5495138,"description":"An artist from a musical family aims to score the final spot in the competition. » Get The Voice Official App: http://bit.ly/TheVoiceOfficialApp » Subscribe for More: http://bit.ly/TheVoiceSub » Watch The Voice at a Special Time, Wednesday 8/7c on NBC! » Get Chris's Performance on iTunes: http://apple.co/2nmxtFI » Watch Full Episodes: http://bit.ly/TheVoiceFullEpisodes THE VOICE ON SOCIAL: Like The Voice: http://Facebook.com/NBCTheVoice Follow The Voice: https://Twitter.com/NBCTheVoice The Voice Tumblr: http://nbcTheVoice.Tumblr.com/ Google+: https://plus.google.com/+TheVoice/ The Voice Pinterest: http://Pinterest.com/nbcTheVoice/ NBC’s The Voice follows the strongest vocalists from across the country and invites them to compete in this season's blockbuster vocal competition. Find The Voice trailers, full episode highlights, previews, promos, clips, and digital exclusives here. NBC ON SOCIAL: NBC YouTube: http://www.youtube.com/nbc Like NBC: http://Facebook.com/NBC Follow NBC: http://Twitter.com/NBC NBC Tumblr: http://nbctv.tumblr.com/ NBC Google+: https://plus.google.com/+NBC/posts NBC Instagram: http://instagram.com/nbc ABOUT THE VOICE The Voice 2017 USA YouTube channel features exclusive content with The Voice coaches, highlights from The Voice auditions, interviews with The Voice winners, as well as The Voice recaps and results. Learn more about The Voice contestants, The Voice tour, the eliminations, and follow your favorite performers all the way to the finale. In season 12, Gwen Stefani returns to join Alicia Keys, Adam Levine and Blake Shelton as celebrity musician coaches, while Carson Daly continues to serve as host. The show's innovative format features five stages of competition: the first begins with the blind auditions, followed by the battle rounds, the knockouts, the live playoffs and finally, the live performance shows. The Voice 2017 Blind Audition - Chris Blue: \"The Tracks of My Tears\" https://youtu.be/_3Fpm_6Go_g The Voice http://www.youtube.com/user/nbcthevoice","category":"Entertainment"},
{"title":"Dave Chappelle | Official Trailer [HD] | Netflix","author":"Netflix US & Canada ","views":1053152,"date":"20170314","id":7638546,"description":"He's back. And with plenty on his mind. Dave Chappelle returns with two stand-up specials from his personal comedy vault on March 21, only on Netflix. Watch Dave Chappelle on Netflix: https://www.netflix.com/title/80171965 SUBSCRIBE: http://bit.ly/29qBUt7 About Netflix: Netflix is the world’s leading Internet television network with over 93.8 million members in over 190 countries enjoying more than 125 million hours of TV shows and movies per day, including original series, documentaries and feature films. Members can watch as much as they want, anytime, anywhere, on nearly any Internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. Connect with Netflix Online: Visit Netflix WEBSITE: http://nflx.it/29BcWb5 Like Netflix on FACEBOOK: http://bit.ly/29kkAtN Follow Netflix on TWITTER: http://bit.ly/29gswqd Follow Netflix on INSTAGRAM: http://bit.ly/29oO4UP Follow Netflix on TUMBLR: http://bit.ly/29kkemT Dave Chappelle | Official Trailer [HD] | Netflix http://youtube.com/netflix","category":"Entertainment"},
{"title":"The Economics of Airline Class","author":"Wendover Productions ","views":1005185,"date":"20170314","id":6122987,"description":"Check out Squarespace: http://www.Squarespace.com/Wendover 10% off code: Wendover Support Wendover Productions on Patreon: https://www.patreon.com/wendoverprodu... Get a Wendover Productions t-shirt for $20: https://store.dftba.com/products/wend... Youtube: http://www.YouTube.com/WendoverProduc... Twitter: http://www.Twitter.com/WendoverPro Email: WendoverProductions@gmail.com Reddit: http://Reddit.com/r/WendoverProductions Select visuals courtesy http://www.Shutterstock.com Sound by Graham Haerther (http://www.Haerther.net) Select visuals courtesy British Airways Select visuals courtesy Etihad Airways Select visuals courtesy Virgin Galactic “Poldoro” by Milton Arias “Summer Movement 1” by John Harrison with the Wichita State University Chamber Players Big thanks to Patreon supporters: Rob Harvey, Venkata Kaushik Nunna, Josh Berger, Paul Jihoon Choi, Huang MingLei, Dylan Benson, Maximillian van Kasbergen, Victor Zimmer, William Chappell, Eyal Matsliah, Sihien,Joseph Bull, Marcelo Alves Vieira, Jonah Paarman, maco2035, Hank Green, Plinio Correa, Connor J Smith, Brady Bellini","category":"Entertainment"},
{"title":"Binging with Babish: Bob's Burgers","author":"Andrew Rea","views":721749,"date":"20170314","id":2833127,"description":"N/A","category":"N/A"},
{"title":"The Disney Afternoon Collection - Announcement Trailer","author":"Capcom Unity ","views":100501,"date":"20170315","id":6757847,"description":"Announcing The Disney Afternoon Collection! 6 classic games like Rescue Rangers, new modes, Rewind & more! Coming to PC, PS4 and Xbox One on April 18, for just $19.99! Subscribe to the Official Capcom Unity Channel: http://bit.ly/Qjb2MV","category":"Gaming"},
{"title":"Casually Explained: Flirting","author":"Casually Explained","views":824955,"date":"20170314","id":4825854,"description":"Even my shirt is made of boyfriend material. Subscribe to Mr. Explained: https://goo.gl/IEE7wl ►https://www.reddit.com/r/CasuallyExpl... ►https://www.facebook.com/CasuallyExpl... ►https://twitter.com/CasuallyE ►https://www.instagram.com/casually_ex...","category":"nem"},
{"title":"DOMONIC'S BABY SHOWER!!!!!!! 🎉👶🏽","author":"Domo and Crissy Vlogs","views":1383386,"date":"20170314","id":664727698,"description":"Domonic is ALMOST here!!!! Thank you all for the unconditional love and support. You guys are family and we appreciate everything! SUBSCRIBE AND BE SURE TO THUMBS UP TO BE NOTIFIED WHEN HE'S BORN!!!!!!! Our Main Channel ⇊ www.youtube.com/Domoandcrissy0915 Our Social Medias ⇊ Instagram: @Domo.Crissy.15 Domonics Instagram: @TheDomonicWilson Snapchat: @DomoAndCrissy Twitter: @DomoAndCrissy YouNow: @DomoAndCrissy WERE ENGAGED !!!! She Proposed - https://youtu.be/IoITZsy7ELo WERE HAVING A BABY !!!!! PREGNANCY TEST RESULTS - https://youtu.be/vrDV2HJ-lAM","category":"Comedy"},
{"title":"New Kids On The Block - One More Night","author":"NewKidsVEVO ","views":184536,"date":"20170314","id":3709182,"description":"From the new EP ‘Thankful’ available May 12. Pre-order it now and get an instant download of “One More Night” on iTunes: https://nkotb.lnk.to/thankful/itunes. Bonus track CD available only at Target: https://nkotb.lnk.to/thankful/target. Click here to stream the track or pre-order the EP: https://nkotb.lnk.to/thankful. Tour kicks off on May 12! Click here for tour dates in N. America: https://nkotb.lnk.to/tour Follow NKOTB on: Facebook: https://www.facebook.com/nkotb/ Instagram: https://www.instagram.com/nkotb/ Twitter: https://twitter.com/nkotb http://vevo.ly/rTjnMi","category":"Music"},
{"title":"Green Brothers Reunited!","author":"vlogbrothers ","views":194923,"date":"20170314","id":3339480,"description":"N/A","category":"N/A"},
{"title":"Trump Mingle Dating App","author":"Late Night with Seth Meyers ","views":221034,"date":"20170314","id":5652124,"description":"Seth has good news for Trump supporters searching for that special someone. » Subscribe to Late Night: http://bit.ly/LateNightSeth » Get more Late Night with Seth Meyers: http://www.nbc.com/late-night-with-se... » Watch Late Night with Seth Meyers Weeknights 12:35/11:35c on NBC. LATE NIGHT ON SOCIAL Follow Late Night on Twitter: https://twitter.com/LateNightSeth Like Late Night on Facebook: https://www.facebook.com/LateNightSeth Find Late Night on Tumblr: http://latenightseth.tumblr.com/ Connect with Late Night on Google+: https://plus.google.com/+LateNightSet... Late Night with Seth Meyers on YouTube features A-list celebrity guests, memorable comedy, and topical monologue jokes. NBC ON SOCIAL Like NBC: http://Facebook.com/NBC Follow NBC: http://Twitter.com/NBC NBC Tumblr: http://NBCtv.tumblr.com/ NBC Pinterest: http://Pinterest.com/NBCtv/ NBC Google+: https://plus.google.com/+NBC YouTube: http://www.youtube.com/nbc NBC Instagram: http://instagram.com/nbctv Trump Mingle Dating App- Late Night with Seth Meyers https://youtu.be/5XMRj7Tg_h8 Late Night with Seth Meyers http://www.youtube.com/user/latenight...","category":"Comedy"},
{"title":"28 Facts about the History of Makeup  - mental_floss List Show Ep. 505","author":"Mental Floss ","views":22513,"date":"20170315","id":7918807,"description":"A weekly show where knowledge junkies get their fix of trivia-tastic information. This week, John takes a look at some of the fascinating, and often lethal, history of makeup! Makeup horror stories: http://www.ewg.org/research/exposing-... Subscribe for new episodes of mental_floss every Wednesday! ---- WE'RE ON SNAPCHAT! Username: mental.floss Mental Floss Video on Twitter: http://www.twitter.com/mf_video ---- Website: http://www.mentalfloss.com Twitter: http://www.twitter.com/mental_floss Facebook: http://www.facebook.com/mentalflossma... Store: http://store.mentalfloss.com/ (enter promo code: \"YoutubeFlossers\" for 15% off!)","category":"Education"},
{"title":"How to Overcome Shyness","author":"The School of Life","views":106175,"date":"20170315","id":3525344,"description":"The secret to overcoming shyness is to remember that others are, beneath the differences, always substantially the same as we are. If you like our films, take a look at our shop (we ship worldwide): https://goo.gl/cxa79A Join our mailing list: http://bit.ly/2e0TQNJ Or visit us in person at our London HQ https://goo.gl/UBN7m7 FURTHER READING “Because shyness can grip us in such powerful ways, it’s tempting to think of it as an immutable part of our emotional make-up, with roots that extend far into our personality and perhaps biology – and that we would be incapable of ever extirpating. But in truth, shyness is based on a set of ideas about the world that are eminently amenable to change through a process of reason because they are founded on some touchingly malleable errors of thought.…” You can read more on this and other subjects on our blog, here: https://goo.gl/nPYbc2 MORE SCHOOL OF LIFE Our website has classes, articles and products to help you think and grow: https://goo.gl/lJMz5H Watch more films on SELF in our playlist: http://bit.ly/TSOLself Do you speak a different language to English? Did you know you can submit Subtitles on all of our videos on YouTube? For instructions how to do this click here: https://goo.gl/VMohil SOCIAL MEDIA Feel free to follow us at the links below: Facebook: https://www.facebook.com/theschoolofl... Twitter: https://twitter.com/TheSchoolOfLife Instagram: https://www.instagram.com/theschoolof... CREDITS Produced in collaboration with: David Horsburgh http://www.davidtheanimator.com/","category":"Education"},
{"title":"Why Is He Called Winnie the Pooh?","author":"SuperCarlinBrothers ","views":253947,"date":"20170314","id":6076336,"description":"Finding Winnie :: http://amzn.to/2np9Ooh How did they get away with calling a children's character... Pooh? In fact none of Winnie the Pooh's name seems to make a lot of sense, so J dives into Pooh's past to discover why he is called Winnie the Pooh. Hey Super Carlin Friends! ►► http://bit.ly/196DDlu Google Autofill Playlist ►► http://bit.ly/1DCdQNm Theories ►► http://bit.ly/1z5uZcS Super Carlin Gaming ►► http://bit.ly/1CRM5Bq - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - BECOME A SUPER CARLIN FRIEND➜ https://www.youtube.com/user/SuperCar... - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - FOLLOW US: T W I T T E R➜ https://twitter.com/jonkerlin & https://twitter.com/SCB_Ben I N S T A G R A M➜ http://instagram.com/jonkerlin & http://instagram.com/scb_ben F A C E B O O K➜ http://www.facebook.com/supercarlinbr... G A M I N G ➜ http://bit.ly/1CRM5Bq P A T R E O N ➜ https://www.patreon.com/SuperCarlinBr... - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - Want to send us something? Super Carlin Brothers PO Box 4339 Roanoke, Virginia 24015 - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - Business Inquiries Only: carlinbrosrtp@gmail.com - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - Every time you give us a thumbs up a Narwhal gets its horn! (maybe..)","category":"DKlarations"},
{"title":"Why Is A Group Of Crows Called A “Murder”?","author":"MinuteEarth ","views":118429,"date":"20170315","id":25496400,"description":"Collective nouns are a great way to have fun with language and nature. PLEASE SUPPORT US ON PATREON: https://www.patreon.com/MinuteEarth Thank you! ___________________________________________ Collective Noun: A noun that denotes a group of individuals. Terms of Venery: Collective nouns specific to certain groups of animals. Clowder: A term for a group of cats that means roughly, huddle, and comes from the same root as clot. ___________________________________________ Credits (and Twitter handles): Script Writer: David Goldenberg (@dgoldenberg) Script Editor: Alex Reich (@alexhreich) Video Illustrator: Qingyang Chen (@QCvisual) Video Director: Henry Reich (@MinutePhysics) Video Narrator: Kate Yoshida (@KateYoshida) With Contributions From: Ever Salazar, Emily Elert, Peter Reich Music by: Nathaniel Schroeder: http://www.soundcloud.com/drschroeder _________________________________________ Like our videos? Subscribe to MinuteEarth on YouTube: http://goo.gl/EpIDGd Support us on Patreon: https://goo.gl/ZVgLQZ Also, say hello on: Facebook: http://goo.gl/FpAvo6 Twitter: http://goo.gl/Y1aWVC And find us on itunes: https://goo.gl/sfwS6n ___________________________________________ If you liked this week’s video, we think you might also like: Mental Floss’s collection of collective nouns: http://mentalfloss.com/article/33580/... ___________________________________________ References: Berners, D. J. (1494). The Boke of Saint Albans. Retrieved from: https://books.google.com/books?id=-aw... Lipton, J. (1993). An Exaltation of Larks. Retrieved from: https://www.amazon.com/Exaltation-Lar... Lund, N. (2015). No, It’s Not Actually a Murder of Crows. Audubon (December). Retrieved from: http://www.audubon.org/news/no-its-no...","category":"Science & Technology"},
{"title":"Stephen Reaches Out To President Obama Via Microwave","author":"The Late Show with Stephen Colbert","views":2089552,"date":"20170314","id":15106903,"description":"Stephen takes a moment during his monologue to demonstrate how the 44th President of the United States is now as accessible as a Totino's Pizza Roll. Subscribe To \"The Late Show\" Channel HERE: http://bit.ly/ColbertYouTube For more content from \"The Late Show with Stephen Colbert\", click HERE: http://bit.ly/1AKISnR Watch full episodes of \"The Late Show\" HERE: http://bit.ly/1Puei40 Like \"The Late Show\" on Facebook HERE: http://on.fb.me/1df139Y Follow \"The Late Show\" on Twitter HERE: http://bit.ly/1dMzZzG Follow \"The Late Show\" on Google+ HERE: http://bit.ly/1JlGgzw Follow \"The Late Show\" on Instagram HERE: http://bit.ly/29wfREj Follow \"The Late Show\" on Tumblr HERE: http://bit.ly/29DVvtR Watch The Late Show with Stephen Colbert weeknights at 11:35 PM ET/10:35 PM CT. Only on CBS. Get the CBS app for iPhone & iPad! Click HERE: http://bit.ly/12rLxge Get new episodes of shows you love across devices the next day, stream live TV, and watch full seasons of CBS fan favorites anytime, anywhere with CBS All Access. Try it free! http://bit.ly/1OQA29B --- The Late Show with Stephen Colbert is the premier late night talk show on CBS, airing at 11:35pm EST, streaming online via CBS All Access, and delivered to the International Space Station on a USB drive taped to a weather balloon. Every night, viewers can expect: Comedy, humor, funny moments, witty interviews, celebrities, famous people, movie stars, bits, humorous celebrities doing bits, funny celebs, big group photos of every star from Hollywood, even the reclusive ones, plus also jokes.","category":"Entertainment"},
{"title":"American Gods | Official Trailer | STARZ","author":"Starz","views":89268,"date":"20170315","id":1894600,"description":"Get your free trial of the STARZ app: http://starz.tv/29ZEg2m Subscribe now for more: http://bit.ly/1kalhP0 Connect with American Gods online: http://starz.com/series/americangods Follow American Gods on Twitter: http://twitter.com/americangodsstz Follow American Gods on Facebook: http://facebook.com/americangodsstarz Follow American Gods on Tumblr: http://americangods.tumblr.com When Shadow Moon is released from prison, he meets the mysterious Mr. Wednesday and a storm begins to brew. Little does Shadow know, this storm will change the course of his entire life. Left adrift by the recent, tragic death of his wife, and suddenly hired as Mr. Wednesday’s bodyguard, Shadow finds himself in the center of a world that he struggles to understand. It’s a world where magic is real, where the Old Gods fear both irrelevance and the growing power of the New Gods, like Technology and Media. Mr. Wednesday seeks to build a coalition of Old Gods to defend their existence in this new America, and reclaim some of the influence that they’ve lost. As Shadow travels across the country with Mr. Wednesday, he struggles to accept this new reality, and his place in it. Like STARZ on Facebook: http://starz.tv/STARZFacebookYT Follow STARZ on Twitter: http://starz.tv/STARZTwitterYT Follow STARZ on Instagram: http://starz.tv/STARZInstagramYT American Gods | Official Trailer | STARZ http://bit.ly/1mkHKgZ","category":"Entertainment"},
{"title":"Stainless Steel Mascara Wand vs Screw","author":"Safiya Nygaard ","views":589660,"date":"20170314","id":5211372,"description":"I try out the Hourglass Stainless Steel \"Lash Curator\" and pit it against a screw I got from a hardware store as a mascara wand! I thankfully didn't lose an eye, but you guys are gonna have to let me know who you think the winner is. And also, if it's a good dupe or just a bad idea? Other videos trying out the Screw Mascara Wand Dupe! https://www.youtube.com/watch?v=IzboZ... https://www.youtube.com/watch?v=IjWja... Don’t forget to click the bell to turn on post notifications! Safiya's Nextbeat: https://nextbeat.co/u/safiya IG: https://www.instagram.com/safiyany/ Twitter: https://twitter.com/safiyajn Facebook: https://www.facebook.com/safnygaard/ MUSIC Mind The Gap Bank Job Hot Sole Take The Fast Train You Can Dance SFX via AudioBlocks","category":"People & Blogs"},
{"title":"The GOP health care plan: The more you need, the less you get","author":"Vox ","views":155373,"date":"20170315","id":2569769,"description":"Paul Ryan’s bill will make more people uninsured than live in New York state. Subscribe to our channel! https://goo.gl/0bsAjO The Congressional Budget Office released its analysis of President Trump's American Health Care Act on Monday, March 13. Ezra Klein explains why this document is one of the most devastating documents he's seen in American politics. Read more here: http://www.vox.com/policy-and-politic... Vox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com to get up to speed on everything from Kurdistan to the Kim Kardashian app. Check out our full video catalog: https://goo.gl/IZONyE Follow Vox on Twitter: https://goo.gl/XFrZ5H Or on Facebook: https://goo.gl/U2g06o","category":"News & Politics"},
{"title":"Marian Hill - Down","author":"MarianHillVEVO","views":327250,"date":"20170314","id":2024800,"description":"Down (Official Video) Taken from the album ACT ONE https://republic.lnk.to/MarianHill-AC... Connect with Marian Hill: http://www.marianhillmusic.com https://facebook.com/marianhillmusic http://instagram.com/marianhillmusic https://twitter.com/marianhillmusic Directed by Jack Begert Produced by Sam Canter & Tyler Sobel-Mason For Psycho Films Down Lyrics: Didn’t even really wanna go But if you get me out you get a show There’s so many bodies on the ﬂoor, So baby we should go and add some more Are you down? Everywhere I look are people’s hands Thrown up in the air to help ‘em dance Come on baby catch me if you can, I Know you don’t have any other plans Are you down? You know we could put ‘em all to shame Now isn’t the time to play it safe Isn’t this the reason why you came? So Baby don’t you let it go to waste Are you down? Every single thing is feeling right Started as a quiet Friday night I don’t really think that we should ﬁght this What if we don’t stop until it’s light? Are you down? Music video by Marian Hill performing Down. © 2017 Republic Records, a Division of UMG Recordings, Inc. (Photo Finish) http://vevo.ly/Hgnf53","category":"Music"},
{"title":"LeBron James Helps Out Kyrie Irving! | 03.14.17","author":"NBA ","views":235405,"date":"20170314","id":1406044,"description":"N/A","category":"N/A"},
{"title":"Snoop Dogg 'shoots' Trump clown in video","author":"CNN ","views":52383,"date":"20170315","id":1412271,"description":"A music video featuring Snoop Dogg is causing controversy because of a scene with a mock execution of a clown dressed as President Trump.","category":"News & Politics"},
{"title":"Tamar & Vince Set the Record Straight","author":"Wendy Williams ","views":577783,"date":"20170314","id":5095581,"description":"Tamar & Vince dish about the new season of \"Braxton Family Values\". Then, Tamar weighs in on the love child rumors, her marriage and reveals what she would say to her former co-hosts on \"The Real\" Plus, Vince tells us how he lost over 90 pounds!","category":"Entertainment"},
{"title":"How to Teleport Schrödinger's Cat","author":"minutephysics","views":190768,"date":"20170315","id":4597274,"description":"Support me on Patreon: http://www.patreon.com/minutephysics Previous video on No Cloning: https://youtu.be/owPC60Ue0BE How to teleport Schrödinger’s cat: this video presents the full quantum teleportation procedure, in which an arbitrary qubit (spin, etc) is teleported from Alice to Bob by way of a pair of particles entangled in a bell (EPR) state and the transmission of information via a classical channel. Thanks to everyone who supports MinutePhysics on Patreon! Link to Patreon supporters here: http://www.minutephysics.com/supporte... REFERENCES: No Cloning video: https://youtu.be/owPC60Ue0BE The No-Cloning Theorem: https://en.wikipedia.org/wiki/No-clon... MinutePhysics on Schrödinger’s Cat: https://www.youtube.com/watch?v=IOYyC... The History of Schrödinger’s (& Einstein’s) Cat: http://nautil.us/issue/41/selection/h... Original Quantum Teleportation Paper: http://citeseerx.ist.psu.edu/viewdoc/... Wikipedia on Quantum Teleportation: https://en.wikipedia.org/wiki/Quantum... Calcium ion teleportation: http://www.nature.com/nature/journal/... Teleporting a 2-qubit state: https://arxiv.org/abs/quant-ph/0407219v3 Multi-level teleportation: https://arxiv.org/abs/quant-ph/0106018v2 Scott Aaronson blog post on Teleportation (& Free Will, etc): http://www.scottaaronson.com/democrit... Classical Teleportation: https://arxiv.org/abs/quant-ph/0107082 Blog post on quantum vs classical teleportation: https://marozols.wordpress.com/2012/0... MinutePhysics is on Google+ - http://bit.ly/qzEwc6 And facebook - http://facebook.com/minutephysics And twitter - @minutephysics Minute Physics provides an energetic and entertaining view of old and new problems in physics -- all in a minute! Created by Henry Reich Music by Nathaniel Schroeder","category":"Science & Technology"},
{"title":"The Challenges of High-Speed Filming","author":"The Slow Mo Guys 2 ","views":248544,"date":"20170314","id":5444968,"description":"Gav waffles on about Phantoms and that. https://twitter.com/GavinFree/ Main Channel: https://www.youtube.com/user/theslowm...","category":"Entertainment"},
{"title":"Red Nose Day Actually Teaser","author":"Trailers Promos Teasers","views":264634,"date":"20170313","id":5774771,"description":"Love Actually BBC Comic Relief special premieres on 24th March","category":"People & Blogs"},
{"title":"Bill Nye's Open Letter to President Donald Trump","author":"The Planetary Society ","views":108262,"date":"20170314","id":9627420,"description":"Bill Nye, CEO of The Planetary Society, and our Board of Directors present five recommendations to the Trump administration as it contemplates the future of the U.S. space program. To read these priorities in detail, visit: http://www.planetary.org/transition Join us: http://planet.ly/joinus Follow us Facebook: http://www.facebook.com/planetarysociety Twitter: http://www.twitter.com/exploreplanets Instagram: http://www.instagram.com/planetarysoc... On the web: http://www.planetary.org Subscribe to our YouTube Channel: http://planet.ly/ytsubscribe Stay in touch with our monthly e-newsletter: http://www.planetary.org/connect About The Planetary Society: The Planetary Society has inspired millions of people to explore other worlds and seek other life. With the mission to empower the world's citizens to advance space science and exploration, its international membership makes the non-governmental Planetary Society the largest space interest group in the world. Carl Sagan, Bruce Murray and Louis Friedman founded the Planetary Society in 1980. Bill Nye, a longtime member of the Planetary Society's Board, serves as CEO.","category":"Science & Technology"},
{"title":"What is McCarthyism? And how did it happen? - Ellen Schrecker","author":"TED-Ed ","views":203122,"date":"20170314","id":3229831,"description":"View full lesson: http://ed.ted.com/lessons/what-is-mcc... In the 1950s, as part of a campaign to expose suspected Communists, thousands of individuals were aggressively investigated and questioned before government panels. Named after its most notorious practitioner, the phenomenon known as McCarthyism destroyed lives and careers. But how did this episode of political repression take off? Ellen Schrecker traces the history of McCarthyism. Lesson by Ellen Schrecker, animation by Patrick Smith.","category":"Education"},
{"title":"KUWTK | Was Kim Kardashian Being Watched Before Paris Robbery? | E!","author":"E! Entertainment ","views":86671,"date":"20170315","id":9662868,"description":"The \"Keeping Up With the Kardashians\" star details her terrifying experience to sisters Kourtney and Khloe. Listen in. SUBSCRIBE: http://bit.ly/Eentsub About Keeping Up With the Kardashians: Things change, but this famous family stays the same. Can you keep up with the drama? Connect with the Kardashians: Visit the KUWTK WEBSITE: http://bit.ly/KUWTKweb Like KUWTK on FACEBOOK: http://bit.ly/KUWTKfb Follow KUWTK on TWITTER: http://bit.ly/KUWTKtwtr About E! Entertainment: E! is on the Pulse of Pop Culture, bringing fans the very best original content including reality series, scripted programming, exclusive specials, breaking entertainment news, streaming events and more. Passionate viewers can’t get enough of our Pop Culture hits including \"Keeping Up with the Kardashians,” “Fashion Police,” “The Royals,” \"Total Divas” and “Botched.” And with new original programming on the way, fans have even more to love. Connect with E! Entertainment: Visit the E! WEBSITE: http://eonli.ne/1iX6d8n Like E! on FACEBOOK: http://on.fb.me/1fzeamg Check out E! on INSTAGRAM: http://bit.ly/EInsta Follow E! on TWITTER: http://bit.ly/EEntTwitter KUWTK | Was Kim Kardashian Being Watched Before Paris Robbery? | E! http://www.youtube.com/user/Eentertai...","category":"Entertainment"},
{"title":"Series 10 Trailer - Doctor Who","author":"Doctor Who ","views":595317,"date":"20170313","id":2854996,"description":"\"To the TARDIS!” Join the Doctor, Bill and Nardole in ‘The Pilot’ on 15th April on BBC One and BBC America. #TimeForHeroes Subscribe here for more exclusive Doctor Who clips and content http://www.youtube.com/subscription_c... The Doctor Who Website - http://www.doctorwho.tv Doctor Who YouTube Channel http://www.youtube.com/user/doctorwho Doctor Who Facebook: https://www.facebook.com/DoctorWho Doctor Who Twitter https://twitter.com/bbcdoctorwho This is a channel from BBC Worldwide who help fund new BBC programmes.","category":"Entertainment"},
{"title":"Project Yorick","author":"ViennaMike","views":899625,"date":"20170315","id":1382782,"description":"Once I saw the Billy Bass version of Alexa (http://www.instructables.com/id/Anima...) I knew what to do between Halloweens with my skull. Details at www.mcgurrin.info/robots/ * Jukin Media Verified * Find this video and others like it by visiting https://www.jukinmedia.com/licensing/... For licensing / permission to use, please email licensing(at)jukinmedia(dot)com.","category":"Howto & Style"},
{"title":"Paul Ryan's conference call with House Republicans 10.10.16","author":"Breitbart News","views":332720,"date":"20170313","id":7056342,"description":"","category":"News & Politics"},
{"title":"The Making of The Legend of Zelda: Breath of the Wild Video – The Beginning","author":"Nintendo ","views":233258,"date":"20170314","id":14512366,"description":"Director Hidemaro Fujibayshi discusses the process and journey of creating The Legend of Zelda: Breath of the Wild. #Nintendo #NintendoSwitch #TheLegendOfZelda #BreathoftheWild Subscribe for more Nintendo fun! https://goo.gl/09xFdP Visit Nintendo.com for all the latest! http://www.nintendo.com/ Like Nintendo on Facebook: http://www.facebook.com/Nintendo Follow us on Twitter: http://twitter.com/NintendoAmerica Follow us on Instagram: http://instagram.com/Nintendo Follow us on Pinterest: http://pinterest.com/Nintendo Follow us on Google+: http://google.com/+Nintendo","category":"YouTube Gaming"},
{"title":"March 14, 2017 Heavy Snow aka Pi Day Storm","author":"ron murphy","views":47096,"date":"20170314","id":3477755,"description":"Heavy snow event on March 14, 2017 as Nor'easter develops and moves up the east US coast. A persistent band of snow stayed over the house for most of the day. This video from all 3 cameras is from 2:00 am EDT to 8:24 am EDT. IMPORTANT NOTE: both cameras are about 12 inches off the ground. At the end of the video the snow was about 19 inches. So there is a wall of snow between the camera and other stuff. Except for the last part which is attached to a window above the deck. Please note the time as well. Images were taken every minute using a Raspberry Pi model B and model B+. Both pi/cameras were outside this time. Another Raspberry Pi Zero stuck to the window took the part with the trees. A forth Raspberry Pi was logging temperatures. Notables: the trees. Final tally on the snowfall amount here, was 22 inches. Slapped together using a combination of imagemagick, ffmpeg and a bit of python. Apalachin, NY USA.","category":"Science & Technology"},
{"title":"Pi Day 3/14/2017 - Venn Piagram","author":"Vihart","views":175621,"date":"20170313","id":1390958,"description":"I can't stop thinking about Venn diagrams. So, as it's Pi Day, this happened. How did it come to this? Well, see http://vihart.com/pi-day-2017-venn-pi... Pi playlist: https://www.youtube.com/playlist?list... This is my 7th annual Pi Day video!","category":"Entertainment"},
{"title":"#GoodMorningDKNY Campaign Film","author":"DKNY ","views":741047,"date":"20170313","id":1280383,"description":"Introducing the new DKNY Spring/Summer 2017 intimates, hosiery and sleepwear campaign, titled #GoodMorningDKNY. Featuring actress and model Emily Ratajkowski, the was shot by fashion photographer, Sebastian Faena, on location in DKNY’s native New York. See the full campaign on DKNY.com","category":"Howto & Style"},
{"title":"Victoria Beckham x Target","author":"Victoria Beckham ","views":7243,"date":"20170315","id":4008848,"description":"My first ever TV advert for #VBxTarget! So much fun with Target Style​ x VB See it now at www.victoriabeckham.com/target TURN IT UP and #spiceupyourlife 🔊","category":"Howto & Style"},
{"title":"Louisville, Duke, Oregon, USC or Virginia Tech? Tahj Rice commits on 'super' Tuesday","author":"The Courier-Journal","views":72186,"date":"20170314","id":13625772,"description":"Faster than a speeding bullet! More powerful than a locomotive! Able to bring down quarterbacks in a single bound! Will four-star Waggener defensive end Tahj Rice go to the hometown Louisville? Or will he pick Duke, Oregon, USC or Virginia Tech?","category":"Sports"},
{"title":"100 Years of Beauty Men: India (Aman)","author":"100 YOB","views":30494,"date":"20170315","id":1223645,"description":"Welcome to the new 100 Years of Beauty channel! For licensing and media inquiries, go to http://www.cut.com/licensing Produced, Directed, and Edited by Cut.com Talent Amandeep Kainth http://instagram.com/just_a_man17 Crew Renee Majour - Hair/Makeup (http://www.facesmakeuphair.com/) Michelle Mai Smith - Hair/Makeup Assistant (www.michellemai.net) Harsimranjeet Singh - Turban styling Research Monomit Sarker (http://imgur.com/a/hfUj5) Music Sticks ’n Stones (Instrumental) - Cold Storage Percussion Unit www.marmosetmusic.com Get Cut swag here: http://bit.ly/BuyCut Don't forget to follow us on social media! Facebook: https://www.facebook.com/watchcut Twitter: https://www.twitter.com/watchcut Instagram: https://www.instagram.com/storiesbycut http://www.instagram.com/100yob Snapchat: watchcut","category":"People & Blogs"},
{"title":"Skillet - Back From the Dead (Official Video)","author":"skilletband ","views":284482,"date":"20170315","id":5085548,"description":"\"Back From The Dead\" off the new album UNLEASHED available now iTunes: http://smarturl.it/SkilletUnleashed Google Play: http://smarturl.it/SkilletUnleashed_GP Amazon: http://smarturl.it/SkilletUnleashed_A Spotify: http://smarturl.it/StreamSkillet","category":"Music"},
{"title":"Children interrupt BBC News interview - BBC News","author":"BBC News ","views":19370629,"date":"20170310","id":3454117,"description":"There was an unexpected distraction for Professor Robert Kelly when he was being interviewed live on BBC News about South Korea. But he managed to keep his composure and complete the interview successfully. Please subscribe HERE http://bit.ly/1rbfUog World In Pictures https://www.youtube.com/playlist?list... Big Hitters https://www.youtube.com/playlist?list... Just Good News https://www.youtube.com/playlist?list...","category":"News & Politics"},
{"title":"The Little Mermaid 2017 - Official Trailer","author":"The Little Mermaid","views":10169508,"date":"20170309","id":5995662,"description":"New live-action film inspired by the classic Hans Christian Andersen fairy tale. By Conglomerate Media and Kingsway Productions. Swimming Summer 2017","category":"Film & Animation"},
{"title":"Alien Attack Cold Open - SNL","author":"Saturday Night Live ","views":6737149,"date":"20170312","id":4580173,"description":"President Donald Trump (Alec Baldwin) addresses members of the military (Kenan Thompson, Kyle Mooney, Aidy Bryant, Leslie Jones, Sasheer Zamata, Beck Bennett, Alex Moffat, Kate McKinnon) during an alien invasion. Get more SNL: http://www.nbc.com/saturday-night-live Full Episodes: http://www.nbc.com/saturday-night-liv... Like SNL: https://www.facebook.com/snl Follow SNL: https://twitter.com/nbcsnl SNL Tumblr: http://nbcsnl.tumblr.com/ SNL Instagram: http://instagram.com/nbcsnl SNL Pinterest: http://www.pinterest.com/nbcsnl/","category":"Entertainment"},
{"title":"Open Announcement 17.3","author":"CrossFit® ","views":683427,"date":"20170309","id":2209268,"description":"For full details and descriptions click here: https://games.crossfit.com/workouts/ The CrossFit Games -- (http://games.crossfit.com) The CrossFit Games® - The Sport of Fitness™ The Fittest On Earth™","category":"Sports"},
{"title":"Barcelona vs. PSG | 2016-17 UEFA Champions League Highlights","author":"FOX Soccer","views":1207648,"date":"20170315","id":4375756,"description":"SUBSCRIBE to get the latest FOX Soccer content: https://www.youtube.com/user/Foxsocce... Full Round of 16 second leg highlights between Barcelona and Paris Saint-Germain. ►Champions League Highlights 2016-17: https://www.youtube.com/playlist?list... ►Bundesliga Highlights & Features 2016-17: https://www.youtube.com/playlist?list... ►The best from Chicharito: https://www.youtube.com/playlist?list... ►FOX Soccer @TheBuzzer: https://www.youtube.com/playlist?list... ►FOX Sports YouTube channel: https://www.youtube.com/foxsports About FOX Soccer: With exclusive highlights, original programming, and behind the scenes footage, FOX Soccer’s YouTube channel provides the sports content that fans are hungry for. FOX Soccer presents: UEFA Champions League, Europa League, Bundesliga, MLS, FIFA World Cup, FIFA Women’s World Cup, Copa America, Gold Cup, CONCACAF Champions League, NWSL and many more.","category":"Sports"},
{"title":"FACETIME SECRETS | Rudy Mancuso, Lele Pons & Anwar Jibawi","author":"Rudy Mancuso ","views":3103899,"date":"20170311","id":6229880,"description":"WATCH MY LAST VIDEO ▶ https://www.youtube.com/watch?v=W3ygY... SUBSCRIBE ► https://www.youtube.com/channel/UC5jk... THANKS FOR WATCHING! LIKE & SUBSCRIBE FOR MORE VIDEOS! ----------------------------------------------------------- FIND ME ON: Instagram | http://instagram.com/rudymancuso Twitter | http://twitter.com/rudymancuso Facebook | http://facebook.com/rudymancuso CAST: Rudy Mancuso | http://youtube.com/c/rudymancuso Anwar Jibawi | http://youtube.com/c/anwar Lele Pons | http://youtube.com/c/lelepons Inanna Sarkis | http://youtube.com/c/inanna Hannah Stocking | http://youtube.com/c/hannahstocking John Shahidi | http://instagram.com/johnny Shots Studios Channels: Anwar Jibawi | http://youtube.com/c/anwar Lele Pons | http://youtube.com/c/lelepons Inanna Sarkis | http://youtube.com/c/inannasarkis Lorenzo Cromwell | http://youtube.com/c/callhimrenny Hannah Stocking | http://youtube.com/c/hannahstocking Awkward Puppets | http://youtube.com/c/awkwardpuppets Maejor | http://youtube.com/c/maejor Shots Studios | http://youtube.com/c/shots","category":"Rudy Mancuso"},
{"title":"American Health Care Act: Last Week Tonight with John Oliver (HBO)","author":"LastWeekTonight ","views":4347862,"date":"20170313","id":9707803,"description":"The Republican health care bill could leave many Americans without affordable coverage. Last Week Tonight's catheter cowboy returns to morning cable news to explain that to Donald Trump. Connect with Last Week Tonight online... Subscribe to the Last Week Tonight YouTube channel for more almost news as it almost happens: www.youtube.com/user/LastWeekTonight Find Last Week Tonight on Facebook like your mom would: http://Facebook.com/LastWeekTonight Follow us on Twitter for news about jokes and jokes about news: http://Twitter.com/LastWeekTonight Visit our official site for all that other stuff at once: http://www.hbo.com/lastweektonight","category":"Entertainment"},
{"title":"$1 Donut Vs. $100 Donut","author":"BuzzFeedVideo ","views":6765262,"date":"20170312","id":2463572,"description":"\"This is truly the best donut I have ever had.\" Check out more awesome videos at BuzzFeedVideo! http://bit.ly/YTbuzzfeedvideo GET MORE BUZZFEED: https://www.buzzfeed.com https://www.buzzfeed.com/videos https://www.youtube.com/buzzfeedvideo https://www.youtube.com/buzzfeedyellow https://www.youtube.com/buzzfeedblue https://www.youtube.com/buzzfeedviolet https://www.youtube.com/perolike BuzzFeedVideo BuzzFeed Motion Picture’s flagship channel. Sometimes funny, sometimes serious, always shareable. New videos posted daily! MUSIC Licensed via Audio Network SFX Provided By AudioBlocks (https://www.audioblocks.com) Monkey Funk_30Edit Licensed via Warner Chappell Production Music Inc. Monkey Funk_Main Licensed via Warner Chappell Production Music Inc. Serenade For Strings In C Major Op 48 II Waltz Licensed via Warner Chappell Production Music Inc. Daffodils Licensed via Warner Chappell Production Music Inc. Genesis_Main Licensed via Warner Chappell Production Music Inc. Created by https://www.buzzfeed.com/bfmp/videos/... + Joanna Park & Katie Villanueva http://birdiesla.com/ + Ryan Ososky http://www.thechurchkeyla.com/ + Teresa Larsen http://www.blinkiesdonuts.com/","category":"People & Blogs"},
{"title":"Honest Trailers - Moana","author":"Screen Junkies ","views":3879430,"date":"20170315","id":3204939,"description":"Brought to you by the Citi® Double Cash Card. Learn more at http://bit.ly/citidoublecash This Honest Trailer scores a Haole for effort - Disney's Moana! You're Welcome! Apologies to Lin Manuel Miranda and The Rock. Got a tip? Email us ► feedback@screenjunkies.com Follow us on Twitter ► http://twitter.com/screenjunkies Like us on Facebook ► http://www.fb.com/screenjunkies Get Screen Junkies Gear! ►► http://bit.ly/SJMerch Download our iPhone App! ►► http://bit.ly/SJAppPlus Download our Android App! ►►http://bit.ly/SJPlusGoogleApp Voiceover Narration by Jon Bailey: http://youtube.com/jon3pnt0 Title design by Robert Holtby Series Created by Andy Signore - http://twitter.com/andysignore & Brett Weiner Written by Spencer Gilbert, Joe Starr, Dan Murrell & Andy Signore Edited by Kevin Williamsen and TJ Nordaker Music by Matt Citron Tokelauan Song by: Gaylon Hindley - Producer Fredwyn Kisona - Singer Isitolo Alesana - Singer Les Atoni - Translator Martha Samasoni - Translator Also while we have you, why not check out our Emmy-Nominated HONEST TRAILERS! Deadpool (Feat. Deadpool) http://bit.ly/HT_Deadpool Game of Thrones Vol. 1 http://bit.ly/HT_GOTv1 Frozen http://bit.ly/HT_Frozen Harry Potter http://bit.ly/HT_HarryPotter Breaking Bad http://bit.ly/HT_BreakingBad The Lord Of The Rings http://bit.ly/HT_LordOfTheRings Star Wars Force Awakens http://bit.ly/HT_ForceAwakens Batman v Superman: Dawn of Justice http://bit.ly/HT_BvS","category":"B.e.a."},
{"title":"Game of Thrones Season 7: Official Tease: Sigils","author":"GameofThrones","views":4996139,"date":"20170309","id":5660622,"description":"#GoTS7 begins 7.16.17 on HBO.","category":"Film & Animation"},
{"title":"Testing the Shower Orange Craze","author":"Good Mythical Morning ","views":1750567,"date":"20170315","id":6348235,"description":"Everyone is eating cold oranges in a hot shower. GMM #1089! Pre-Order the Book of Mythicality at https://www.bookofmythicality.com/ SUBSCRIBE to GMM: http://bit.ly/subrl2 | Watch today's GMMore episode: https://goo.gl/wdXZv9 COMMENT TAKEOVER: Go to the below video link and tell them the biggest fish you'd fry... https://www.youtube.com/watch?v=yqBBj... Join us in donating to the American Refugee Committee at http://arcrelief.org. Every donation goes toward assisting in their mission to provide refugees with health, education, shelter, and protection services. For rules and more info on how to submit a #10SecondTour go to http://www.rhettandlink.com/10secondtour Follow Rhett & Link: Facebook: http://facebook.com/rhettandlink Twitter: http://twitter.com/rhettandlink Tumblr: http://rhettandlink.tumblr.com Instagram: http://instagram.com/rhettandlink Other Rhett & Link Channels: Main Channel: https://youtube.com/rhettandlink Good Mythical MORE: https://youtube.com/user/rhettandlink3 Rhett & Link EXTRAS: https://youtube.com/user/rhettandlink4 GMM Merch: Poster, T-shirt & More: http://bit.ly/RL_Store Coffee Mug: http://bit.ly/GMM_Mug Watch More GMM: Choose a Season: http://bit.ly/2axhxZN Popular Videos: http://bit.ly/2afIJ12 Latest Uploads: http://bit.ly/2aZMw3K Will It?: http://bit.ly/2a64BiV Taste Tests: http://bit.ly/2a4v5hZ Listen to our FREE podcast, Ear Biscuits on: iTunes: http://apple.co/29PTWTM SoundCloud:https://soundcloud.com/earbiscuits JOIN the RhettandLinKommunity: http://bit.ly/rlkommunity Mail us stuff to our P.O. Box: http://rhettandlink.com/contact Submit a Wheel of Mythicality intro video: http://bit.ly/GMMWheelIntro We are two Internetainers dedicated to giving you a daily dose of casual comedy every Monday-Friday on our show \"Good Mythical Morning.\" Thanks for making us a part of your daily routine. Be your mythical best! - Rhett & Link Credits: Executive Producer: Stevie Wynne Levine Writer/Producer: Edward Coleman Writer/Producer: Lizzie Bassett Writer/Producer: Kevin Kostelnik Writer/Producer: Micah Gordon Writer/Producer: Ellie McElvain Associate Producer: Chase Hilt Technical Director/Graphics/Editor: Morgan Locke Editor: Casey Nimmer Additional Graphics/Editing: Matthew Dwyer Art Director: Colin J. Morris Production Coordinator: Alexander Punch Production Assistant: Mike Criscimagna Content Manager: John Warder Set Construction/Dresser: Cassie Cobb Intro Motion Graphics: Digital Twigs http://www.digitaltwigs.com Intro Music: Pomplamoose http://www.youtube.com/pomplamoosemusic Outro Music: Pomplamoose http://www.youtube.com/pomplamoosemusic Wheel of Mythicality Music: http://www.royaltyfreemusiclibrary.com/ All Supplemental Music: Opus 1 Music | http://opus1.sourceaudio.com/ Microphone: ‘The Mouse’ by Blue Microphones http://www.bluemic.com/mouse/","category":"Entertainment"},
{"title":"10 Songs with Creepy Hidden Messages!","author":"MatthewSantoro ","views":1435868,"date":"20170315","id":5359614,"description":"New videos every weekday at 3PM (EST)! http://MatthewSantoro.com My socials! Facebook: http://fb.com/MatthewSantoroOfficial Instagram: http://instagr.am/MatthewSantoro Twitter: http://twitter.com/MatthewSantoro Snapchat: http://bit.ly/SantoroSnapchat Get my book MIND = BLOWN here! http://bit.ly/MattsBook Sources: http://www.vh1.com/news/52612/15-song... http://mentalfloss.com/article/57351/... https://en.wikipedia.org/wiki/Imagine...) http://ultimateclassicrock.com/judas-... http://www.bbc.com/culture/story/2014... https://en.wikipedia.org/wiki/Stairwa... http://www.subliminal-video.com/britn... http://www.subliminal-video.com/pante...","category":"Jim Vaylin"},
{"title":"ROUGH NIGHT - Official Restricted Trailer (HD)","author":"Sony Pictures Entertainment ","views":2691919,"date":"20170315","id":10888945,"description":"Watch Scarlett Johansson, Kate McKinnon, Jillian Bell, Ilana Glazer, and Zoë Kravitz in the all new #RoughNightMovie trailer. In theaters June 16. Follow Us on Social: Facebook: https://www.facebook.com/RoughNightMo... Twitter: https://twitter.com/roughnightmovie Instagram: https://www.instagram.com/roughnightm... Subscribe for exclusives: http://bit.ly/SonyPicsSubscribeYT Synopsis: Five best friends from college (played by Scarlett Johansson, Kate McKinnon, Jillian Bell, Ilana Glazer, and Zoë Kravitz) reunite 10 years later for a wild bachelorette weekend in Miami. Their hard partying takes a hilariously dark turn when they accidentally kill a male stripper. Amidst the craziness of trying to cover it up, they're ultimately brought closer together when it matters most. Starring: Scarlett Johansson Kate McKinnon Jillian Bell Ilana Glazer Zoë Kravitz Paul W. Downs","category":"Entertainment"},
{"title":"That Was the Week that WTF | Full Frontal with Samantha Bee | TBS","author":"Full Frontal with Samantha Bee ","views":1464101,"date":"20170309","id":16598918,"description":"A new cornerstone of the conservative platform: media whiplash for all Americans! Watch Full Frontal with Samantha Bee all new Wednesdays at 10:30/ 9:30c on TBS!","category":"People & Blogs"},
{"title":"Fleet Foxes - Third of May / Ōdaigahara (Lyric Video)","author":"Fleet Foxes","views":1009846,"date":"20170315","id":4967025,"description":"Fleet Foxes' \"Third of May / Ōdaigahara\" from the 2017 album Crack-Up. Video by Sean Pecknold & Adi Goodrich. Get the track now when you pre-order the album: http://smarturl.it/CrackUp.all See Fleet Foxes on tour: http://fleetfoxes.co/ /// https://www.facebook.com/fleetfoxes https://www.instagram.com/robinpecknold/","category":"People & Blogs"},
{"title":"DO WHAT YOU CAN'T","author":"CaseyNeistat ","views":3244092,"date":"20170315","id":1579428,"description":"MAX JOSEPH'S, MY COLLABORATOR AND GENIUS BEHIND THIS VIDEO, CHANNEL https://www.youtube.com/maxjosephdire... MUSIC; 'Carte Postale' by Sløve from the album 'Le Danse': Spotify: http://spoti.fi/2ljFPMF / Apple Music https://itun.es/fr/PdFYB Courtesy of Pschent Music: Spotify http://spoti.fi/2kXgMD9 / Youtube http://www.youtube.com/PschentOfficial Huge thank you to all the creators to contributed to this video; Devinsupertramp - https://www.youtube.com/devinsupertramp Roman Atwood - https://www.youtube.com/RomanAtwoodVlogs John Olsson - https://www.youtube.com/JonOlssonVide... diSCIpling Recovery - https://www.youtube.com/disciplingrec... Zane Hijazi - https://www.youtube.com/zanehijazi Philip Defranco - https://www.youtube.com/philipdefranco Joey Da Prince - https://www.youtube.com/JoeyDaPrinceTv Liza Koshy - https://www.youtube.com/lizakoshy PrankvsPrank - https://www.youtube.com/PrankvsPrank Grace Helbig - https://www.youtube.com/graciehinabox Lilly Singh - https://www.youtube.com/IISuperwomanII TheSyndicateProject - https://www.youtube.com/TheSyndicateP... Marques Brownlee - https://www.youtube.com/marquesbrownlee Arden Rose - https://www.youtube.com/ARose186 William Haynes - https://www.youtube.com/WilliamHaynesTV EhBeeFamily - https://www.youtube.com/ehbeefamily Sara Deitschy - https://www.youtube.com/saradietschy Sprinkleofglitter - https://www.youtube.com/Sprinkleofgli... Piano Around the World - https://www.youtube.com/pianoaround Gigi Gorgeous - https://www.youtube.com/GregoryGORGEOUS Jason Paul - https://www.youtube.com/channel/UCDMX... Louis Cole - https://www.youtube.com/FunForLouis Lindsey Stirling - https://www.youtube.com/lindseystomp FaZe Adapt - https://www.youtube.com/AHDAPTING FaZe Rain - https://www.youtube.com/TrickShotting Ben Brown - https://www.youtube.com/benbrown Shonduras - https://www.youtube.com/Shonduras Sam Sheffer - https://www.youtube.com/Samsheffer Meghan Tonjes - https://www.youtube.com/meghantonjes SuperSaf TV - https://www.youtube.com/SuperSafTV Merrel Twins - https://www.youtube.com/merrelltwins Rosanna Pansino - https://www.youtube.com/RosannaPansino iJustine - https://www.youtube.com/ijustine h3h3 Productions - https://www.youtube.com/h3h3productions Furious Pete - https://www.youtube.com/furiouspete David Dobrik - https://www.youtube.com/daviddobrik Unbox Therapy - https://www.youtube.com/unboxtherapy Quentin Kenihan - https://www.youtube.com/qkenihan Mislav Mironovic - https://www.youtube.com/channel/UCIcf...","category":"People & Blogs"},
{"title":"WONDER WOMAN - Official Origin Trailer","author":"Warner Bros. Pictures ","views":5877217,"date":"20170311","id":6845914,"description":"This June, witness the future of justice. #WonderWoman -- Wonder Woman is in theaters June 2, 2017. Follow #WonderWoman on social media: Facebook: https://www.facebook.com/wonderwomanfilm Twitter: https://twitter.com/WonderWomanFilm Instagram: http://instagram.com/WonderWomanFilm -- WONDER WOMAN From Warner Bros. Pictures and DC Entertainment comes the epic action adventure starring Gal Gadot, Chris Pine, Connie Nielsen and Robin Wright, directed by Patty Jenkins. Before she was Wonder Woman, she was Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, when an American pilot crashes on their shores and tells of a massive conflict raging in the outside world, Diana leaves her home, convinced she can stop the threat. Fighting alongside man in a war to end all wars, Diana will discover her full powers…and her true destiny.","category":"Entertainment"},
{"title":"Safaree Weighs in on Remy Ma & Nicki Minaj's Rap Battle","author":"Wendy Williams ","views":1354756,"date":"20170315","id":7306475,"description":"Safaree weighs in on the rap battle between his ex, Nicki Minaj and Remy Ma.","category":"Entertainment"},
{"title":"If Star Wars Took Place Today!","author":"nigahiga ","views":2756979,"date":"20170310","id":2560551,"description":"Star War's is supposed to take place LONG AGO in a galaxy far, far away... but what would it look like NOW, in a galaxy close, close by? Also, just because I know people are going to ask, we made this just for fun. There is no real kickstarter page. Click here to see bloopers and BTS for this video: https://www.youtube.com/watch?v=_gNaJ... Just Launched New Official Store https://www.gianthugs.com/collections... Nigahiga Channel http://www.youtube.com/nigahiga HigaTV Channel http://www.youtube.com/higatv Twitter http://www.twitter.com/therealryanhiga Facebook http://www.facebook.com/higatv Website http://www.higatv.com Instagram http://www.instagram.com/notryanhiga Send us mail or whatever you want here! PO Box 232355 Las Vegas, NV 89105 Download the TEEHEE app for iPhone and Android here: iPhone:http://goo.gl/KXLz9j Android: http://goo.gl/RQZUKR","category":"Moo-Lester"},
{"title":"Justin Bieber Tells Female Fan You Make Me Sick.","author":"Watch Game","views":1231378,"date":"20170312","id":3811023,"description":"Justin Bieber Tells Female Fan You Make Me Sick. JUSTIN BIEBER SNAPS AT SELFIE-TAKING FEMALE FAN: ‘YOU MAKE ME SICK’ [VIDEO] Justin Bieber was grossed out by a female fan getting all up in his space for a pic, and he let her know it ... straight up. Justin was in Melbourne, Australia Saturday, where a young girl tried snapping a selfie of herself next to the pop star grubbing on some finger food. He lectures her on respect ... and then burns her with a harsh line. Bieber ... don't bother him ... he's eating.","category":"Entertainment"},
{"title":"Future - Use Me","author":"FutureVEVO ","views":4983523,"date":"20170315","id":1399465,"description":"\"Hndrxx\" Available at iTunes: http://smarturl.it/HNDRXX Apple Music: http://smarturl.it/HNDRXX.AM Spotify: http://smarturl.it/HNDRXX.Sptfy Google Play: http://smarturl.it/HNDRXX.GP Amazon Digital: http://smarturl.it/HNDRXX.Dig Deezer: http://smarturl.it/HNDRXX.Dzr Soundcloud: http://smarturl.it/HNDRXX.SC Tidal: http://smarturl.it/HNDRXX.Tidal Directed by: Nick Walker and Daniel Pappas www.futurefreebandz.com www.facebook.com/futureofficial www.twitter.com/1future www.instagram.com/future www.youtube.com/officialfuturevideos www.soundcloud.com/futureisnow (C) 2017 Epic Records, a division of Sony Music Entertainment","category":"Music"},
{"title":"Pitbull & J Balvin - Hey Ma ft Camila Cabello (Spanish Version | The Fate of the Furious: The Album)","author":"Warner Music En Español ","views":15101023,"date":"20170310","id":20684159,"description":"Download and stream “Hey Ma” (Spanish Version) from The Fate of the Furious: The Album: https://atlantic.lnk.to/f8 The Fate of the Furious: The Album arrives everywhere on 4.14.17, pre-order now - iTunes: https://atlantic.lnk.to/f8/itunes Apple Music: https://atlantic.lnk.to/f8/applemusic Spotify: https://atlantic.lnk.to/f8/spotify Google Play: https://atlantic.lnk.to/f8/google-play THE FATE OF THE FURIOUS: THE ALBUM TRACK LISTING 1) Young Thug, 2 Chainz, Wiz Khalifa & PnB Rock - Gang Up 2) Lil Uzi Vert, Quavo & Travis Scott - Go Off 3) G-Eazy & Kehlani - Good Life 4) PnB Rock, Kodak Black & A Boogie Wit da Hoodie – Horses 5) Migos - Seize The Block 6) YoungBoy Never Broke Again – Murder (feat. 21 Savage) [Remix] 7) Bassnectar – Speakerbox (feat. Ohana Bam & Lafa Taylor) [F8 Remix] 8) Post Malone - Candy Paint 9) Kevin Gates - 911 10) Lil Yachty – Mamacita (feat. Rico Nasty) 11) Jeremih, Ty Dolla $ign & Sage The Gemini - Don't Get Much Better 12) Pitbull & J Balvin - Hey Ma (feat. Camila Cabello) [Spanish Version] 13) Pinto “Wahin” & DJ Ricky Luna - La Habana (feat. El Taiger) 14) J Balvin & Pitbull - Hey Ma (feat. Camila Cabello) FOLLOW PITBULL: http://twitter.com/pitbull http://instagram.com/pitbull https://www.facebook.com/pitbull FOLLOW J BALVIN: http://twitter.com/jbalvin http://instagram.com/jbalvin https://www.facebook.com/JBalvinOficial FOLLOW CAMILA CABELLO: http://twitter.com/camilacabello97 http://instagram.com/camila_cabello https://www.facebook.com/97camilacabe... Follow The Fate of the Furious: http://twitter.com/fastfurious http://instagram.com/fastandfuriousmovie https://www.facebook.com/FastandFurious/ http://www.fastandfurious.com/","category":"Music"},
{"title":"Trump's Lies on Wiretapping, Health Care: A Closer Look","author":"Late Night with Seth Meyers ","views":2191124,"date":"20170313","id":13015111,"description":"Seth takes a closer look at Trump's outlandish claims on wiretapping and the Republican plan to repeal and replace Obamacare. » Subscribe to Late Night: http://bit.ly/LateNightSeth » Get more Late Night with Seth Meyers: http://www.nbc.com/late-night-with-se... » Watch Late Night with Seth Meyers Weeknights 12:35/11:35c on NBC. LATE NIGHT ON SOCIAL Follow Late Night on Twitter: https://twitter.com/LateNightSeth Like Late Night on Facebook: https://www.facebook.com/LateNightSeth Find Late Night on Tumblr: http://latenightseth.tumblr.com/ Connect with Late Night on Google+: https://plus.google.com/+LateNightSet... Late Night with Seth Meyers on YouTube features A-list celebrity guests, memorable comedy, and topical monologue jokes. NBC ON SOCIAL Like NBC: http://Facebook.com/NBC Follow NBC: http://Twitter.com/NBC NBC Tumblr: http://NBCtv.tumblr.com/ NBC Pinterest: http://Pinterest.com/NBCtv/ NBC Google+: https://plus.google.com/+NBC YouTube: http://www.youtube.com/nbc NBC Instagram: http://instagram.com/nbctv Trump's Lies on Wiretapping, Health Care: A Closer Look- Late Night with Seth Meyers https://youtu.be/_isYp06LPts Late Night with Seth Meyers http://www.youtube.com/user/latenight...","category":"Comedy"},
{"title":"Nintendo Switch painful launch","author":"CrowbCat","views":8243166,"date":"20170315","id":2319016,"description":"Switch users experiencing a wide range of different issues from day one. Reports are submitted everyday with new pictures and videos. Loud crashes, errors, bricked blue/orange screens, dead pixels, ingame artifacts, unrecognized cartridges, loose/woobly joycons, scratches and design flaws. ------- Credits and sources ------- 0:16 xHaVoK87 https://youtu.be/8ff-reCdqgs 0:31 Demacro Jira https://youtu.be/B0HgXXWh4oQ 0:47 TeamosMagister https://youtu.be/co1khnnbn48 1:15 farfromsubtle https://youtu.be/6rKRJ584Lf8 1:43 SlimDreDrizzy https://youtu.be/1A4SC5o3lB4 1:55 Snarfuofficial https://youtu.be/AkwRjMEtG0c 2:01 Sam85ification https://youtu.be/l6a8Hqmo0fs 2:16 Blunty https://youtu.be/XUZ-Icqhemw 2:30 Date Night https://youtu.be/yZ-SDppreOw 2:33 iFixit https://youtu.be/QCZ3-fYjpWo 2:37 Spawn Wave https://youtu.be/LxUuDh5dOus 2:46 Static Fyre TV https://youtu.be/-ofZ41HIgSU 2:52 Date Night https://youtu.be/yZ-SDppreOw?t=9m16s 3:03 kNIGHTWING01 https://youtu.be/Edo1jW9VfoE 3:13 Mickael Letellier https://youtu.be/ZVKM4ZJC0NA 3:25 AdrianDX https://youtu.be/QBFssnEYPm0 3:34 CadenYurk https://youtu.be/Fa9fTKn5wd0 3:48 MKent511 https://youtu.be/azgEnFXBO34 3:57 Bradley Smith https://youtu.be/sb9lkh_LJ5U 4:02 Christopher Zilla https://youtu.be/Xv5AAjexqvc 4:07 felfercab https://youtu.be/zFvIkTxk5KQ 4:19 Darby Janssen https://youtu.be/spJQImB4RUY 4:46 The Know https://youtu.be/Gv9Jr4RNR3A 5:18 RKosmik https://youtu.be/aeLLB1loOOk 5:26 Reviewer G https://youtu.be/gO2ZKLgOHks 5:41 Alexander Tompkins https://youtu.be/tiidikvilBs 5:48 M Fasa! https://youtu.be/8iWePQ_ZCP4 6:01 Wallace Santos https://youtu.be/YMvGccWFloI 6:06 GameRiot https://youtu.be/dZZNz93MHGk 6:15 Le Tib Riding https://youtu.be/AXVyp_oKof4 6:28 CadenYurk https://youtu.be/Fa9fTKn5wd0 6:56 Mabus the Argonaut https://youtu.be/7qYN8i6UUVI 7:05 Mondo Miramontes https://youtu.be/PzhGsOTNLFc 7:28 Mariusz Borkiet https://youtu.be/494bj5nb6tQ 7:37 WolfPackLp https://youtu.be/UI_SOhR5EOs 7:50 Jeff Jenkins https://youtu.be/LLwbxLXYYN4 7:53 BubblegumBalloon https://youtu.be/QeQleoYVw4Y 7:57 WolfPackLp https://youtu.be/UI_SOhR5EOs?t=4m50s 8:04 MKent511 https://youtu.be/j3E3eeh4kOc 8:16 Lloldrin https://youtu.be/sq6Y9T3ofyU 8:28 MonkeySpaz5000 https://youtu.be/Schyo9dxIHM 8:39 Tech Dump https://youtu.be/kT5bRKC91WU 8:52 The Way out Gaming https://youtu.be/JSsDmFzK_T0 8:57 FZeroRacer https://youtu.be/ujLvXytljVM 9:11Technibility https://youtu.be/cF4IaDRFA18 9:25 Dan G https://youtu.be/07qmXG8Jc7c 9:36 gonzalogones https://youtu.be/JZk-6UcoJoE 9:42 SirWalrus Gaming https://youtu.be/OYpo-YbjJJs 10:09 Ricky Tappenden https://youtu.be/PDROQ_pnfSg 10:15 SAWA https://youtu.be/T7ANigSLMWE 10:26 ion litio https://youtu.be/Szj7cKw5t7U 10:31 Ricardo Ferreira https://youtu.be/Vf8lQSv6X84 10:47 Sam85ification https://youtu.be/l6a8Hqmo0fs?t=40s 11:04 Nioute https://youtu.be/N2r5_QcNSZU 11:20 Horox f https://youtu.be/bnX6kkjQTJM 11:57 Jamar Leetrail https://youtu.be/3nnj29ttbcM","category":"Gaming"}]
